### Terraform `plan` Succeeded for Workspace: `prd`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = "rtb-01dd56d2a112bcad8"
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = "rtb-01dd56d2a112bcad8"
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "100.64.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                            = "prd-pod-1a"
+           "environment"                     = "prd"
+           "kubernetes.io/role/internal-elb" = "1"
+           "owners"                          = "jingood2"
        }
+       tags_all                                       = {
+           "Name"                            = "prd-pod-1a"
+           "environment"                     = "prd"
+           "kubernetes.io/role/internal-elb" = "1"
+           "owners"                          = "jingood2"
        }
+       vpc_id                                         = "vpc-0d4f2a437bee6c2c4"
    }

  # module.vpc.aws_subnet.private[3] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "100.64.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                            = "prd-pod-1c"
+           "environment"                     = "prd"
+           "kubernetes.io/role/internal-elb" = "1"
+           "owners"                          = "jingood2"
        }
+       tags_all                                       = {
+           "Name"                            = "prd-pod-1c"
+           "environment"                     = "prd"
+           "kubernetes.io/role/internal-elb" = "1"
+           "owners"                          = "jingood2"
        }
+       vpc_id                                         = "vpc-0d4f2a437bee6c2c4"
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
+   resource "aws_vpc_ipv4_cidr_block_association" "this" {
+       cidr_block = "100.64.0.0/16"
+       id         = (known after apply)
+       vpc_id     = "vpc-0d4f2a437bee6c2c4"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>